CreateViewTemplate Method
 Creates a new view template instance from this view instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public View CreateViewTemplate()
Visual Basic
Public Function CreateViewTemplate As View
Visual C++
public:
View^ CreateViewTemplate()
Return Value
 New view template instance
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException |  The view is not valid for view template creation.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →